Revit 2027 API
BuiltInFailures.StairRampFailures.MultistoryStairDoesntReach Property
 The multistory stair/ramp could not reach its top level with integral number of flights. Maximum number of flights below the top level is created.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId MultistoryStairDoesntReach { get; }
Public Shared ReadOnly Property MultistoryStairDoesntReach As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ MultistoryStairDoesntReach {
	FailureDefinitionId^ get ();
}
static member MultistoryStairDoesntReach : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace